# SyncMatrixToBound

## Description
Synchronize the object's matrix with the specified story bound.

```pascal
PROCEDURE SyncMatrixToBound(
				obj     : HANDLE;
				BoundID : INTEGER);
```

```python
def vs.SyncMatrixToBound(obj, BoundID):
    return None
```

## Parameters
|Name|Type|Description|
|---|---|---|
|obj|HANDLE|The object handle.|
|BoundID|INTEGER|The identifier of the story bound.|

## Version
Availability: from Vectorworks 2013

## Category
* Objects - Architectural